app/controllers/pages_controller.rb

  def show
	@page = Page.find(params[:id])
---
SELECT  `pages`.* FROM `pages`  WHERE `pages`.`id` = 2 LIMIT 1

  def edit
	@page = Page.find(params[:id])
	@subjects = Subject.order('position ASC')
	@page_count = Page.count
---
SELECT  `pages`.* FROM `pages`  WHERE `pages`.`id` = 2 LIMIT 1
SELECT `subjects`.* FROM `subjects`   ORDER BY position ASC
SELECT COUNT(*) FROM `pages`

  def update
	@page = Page.find(params[:id])
	if @page.update_attributes(page_params)
---
SELECT  `pages`.* FROM `pages`  WHERE `pages`.`id` = 3 LIMIT 1
UPDATE `pages` SET `subject_id` = 2, `updated_at` = '2015-02-03 10:21:05' WHERE `pages`.`id` = 3

  def delete
	@page = Page.find(params[:id])
---
SELECT  `pages`.* FROM `pages`  WHERE `pages`.`id` = 2 LIMIT 1