app/controllers/sections_controller.rb

SELECT  `sections`.* FROM `sections`  WHERE `sections`.`id` = 1 LIMIT 1
---
  def show
	@section = Section.find(params[:id])

SELECT  `sections`.* FROM `sections`  WHERE `sections`.`id` = 1 LIMIT 1
---
  def edit
	@section = Section.find(params[:id])

SELECT  `sections`.* FROM `sections`  WHERE `sections`.`id` = 1 LIMIT 1
---
  def delete
	@section = Section.find(params[:id])