app/controllers/subjects_controller.rb

SELECT  `subjects`.* FROM `subjects`  WHERE `subjects`.`id` = 1 LIMIT 1
---
  def show
	@subject = Subject.find(params[:id])

SELECT COUNT(*) FROM `subjects`
---
  def new
	@subject = Subject.new({:name => "Default"})
	@subject_count = Subject.count + 1

INSERT INTO `subjects` (`created_at`, `name`, `position`, `updated_at`) VALUES ('2014-12-10 23:30:51', 'Test Subject', 8, '2014-12-10 23:30:51')
---
  def create
	@subject = Subject.new(subject_params)
	if @subject.save

SELECT  `subjects`.* FROM `subjects`  WHERE `subjects`.`id` = 5 LIMIT 1
SELECT COUNT(*) FROM `subjects`
---
  def edit
	@subject = Subject.find(params[:id])
	@subject_count = Subject.count

SELECT  `subjects`.* FROM `subjects`  WHERE `subjects`.`id` = 5 LIMIT 1
UPDATE `subjects` SET `created_at` = '2012-12-10 16:02:00', `updated_at` = '2015-02-03 10:32:40' WHERE `subjects`.`id` = 1
SELECT COUNT(*) FROM `subjects`
---
  def update
	@subject = Subject.find(params[:id])
	if @subject.update_attributes(subject_params)
		flash[:notice] = "Subject updated successfully."
		redirect_to(:action => 'show', :id => @subject.id)
	else
		@subject_count = Subject.count

SELECT  `subjects`.* FROM `subjects`  WHERE `subjects`.`id` = 5 LIMIT 1
---
  def delete
	@subject = Subject.find(params[:id])

DELETE FROM `subjects` WHERE `subjects`.`id` = 5
SELECT  `subjects`.* FROM `subjects`  WHERE `subjects`.`id` = 5 LIMIT 1
---
  def destroy
	subject = Subject.find(params[:id]).destroy